content/posts/Why_you_should_walk_more_by_Kelly_Starrett_in_2020.md
+++
title = "Why you should walk more by Kelly Starrett in 2020"
author = ["Cameron Smith"]
lastmod = 2020-09-24T01:56:59-04:00
slug = "Why_you_should_walk_more_by_Kelly_Starrett_in_2020"
draft = false
+++

## [Kelly Starrett]({{< relref "Kelly_Starrett" >}}), [mobility]({{< relref "mobility" >}}) {#kelly-starrett--kelly-starrett-dot-md--mobility--mobility-dot-md}


## <https://web.archive.org/web/20200420033757/https://thereadystate.com/why-you-should-walk-more-according-to-kelly-starrett/> {#https-web-dot-archive-dot-org-web-20200420033757-https-thereadystate-dot-com-why-you-should-walk-more-according-to-kelly-starrett}


## \_\_Rucking doesn’t require fancy equipment or technique. You were literally born for this. I have been prescribing short bouts of walking to people experiencing back pain and persistent pain for as long as I’ve been a physiotherapist. Progressing those walks by making them longer and “heavier” actually follows every principle of loading progression that exists today. Our friends over at GORUCK even make cool packs and loadable plates. They have created incredible events where crazy people can go have an adventure with their friends while carrying a loaded backpack.\_\_ — via [Why You Should Walk More \* The Ready State](<https://thereadystate.com/why-you-should-walk-more-according-to-kelly-starrett/?utm%5Fsource=Newsletter&utm%5Fmedium=Email&utm%5Fcampaign=WalkMoreBlog>) {#rucking-doesn-t-require-fancy-equipment-or-technique-dot-you-were-literally-born-for-this-dot-i-have-been-prescribing-short-bouts-of-walking-to-people-experiencing-back-pain-and-persistent-pain-for-as-long-as-i-ve-been-a-physiotherapist-dot-progressing-those-walks-by-making-them-longer-and-heavier-actually-follows-every-principle-of-loading-progression-that-exists-today-dot-our-friends-over-at-goruck-even-make-cool-packs-and-loadable-plates-dot-they-have-created-incredible-events-where-crazy-people-can-go-have-an-adventure-with-their-friends-while-carrying-a-loaded-backpack-dot-via-why-you-should-walk-more-the-ready-state--https-thereadystate-dot-com-why-you-should-walk-more-according-to-kelly-starrett-utm-source-newsletter-and-utm-medium-email-and-utm-campaign-walkmoreblog}
